In [22]:
import pandas as pd

data = {
    'Employee': ['John', 'Alice', 'Bob', 'David', 'Eva', 'Frank', 'Grace', 'Helen'],
    'Department': ['HR', 'IT', 'HR', 'Finance', 'IT', 'Finance', 'HR', 'Finance'],
    'Salary': [50000, 60000, 45000, 70000, 65000, 55000, 52000, 72000],
    'YearsExperience': [2, 5, 3, 8, 6, 4, 4, 10]
}

df = pd.DataFrame(data)
df

""" 	1.	What is the total salary for each department?
	2.	What is the average salary for each department?
	3.	How many employees are in each department?
	4.	What is the maximum salary in each department?
	5.	What is the minimum salary in each department?
	6.	What is the average years of experience in each department?
	7.	Find the total salary and average years of experience grouped by department. """

' \t1.\tWhat is the total salary for each department?\n\t2.\tWhat is the average salary for each department?\n\t3.\tHow many employees are in each department?\n\t4.\tWhat is the maximum salary in each department?\n\t5.\tWhat is the minimum salary in each department?\n\t6.\tWhat is the average years of experience in each department?\n\t7.\tFind the total salary and average years of experience grouped by department. '

In [23]:
salaries = df.groupby('Department').agg({'Salary':'sum'})
display(salaries)

            Salary
Department
Finance     197000
HR          147000
IT          125000

In [24]:
salaries = df.groupby('Department').agg({'Salary':'mean'})
display(salaries)

                  Salary
Department
Finance     65666.666667
HR          49000.000000
IT          62500.000000

In [25]:
employees = df.groupby('Department').agg({'Employee':'count'})
display(employees)

            Employee
Department
Finance            3
HR                 3
IT                 2

In [28]:
max_salaries = df.groupby('Department').agg({'Salary':'max'})
display(max_salaries)

            Salary
Department
Finance      72000
HR           52000
IT           65000

In [ ]:
max_salaries = df.groupby('Department').agg({'Salary':'min'})
display(max_salaries)

            Salary
Department
Finance      72000
HR           52000
IT           65000

In [30]:
seniority = df.groupby('Department').agg({'YearsExperience':'mean'})
display(seniority)

            YearsExperience
Department
Finance            7.333333
HR                 3.000000
IT                 5.500000

In [36]:
result = df.groupby('Department').agg({'YearsExperience':'mean','Salary':'sum'})
display(result)

            YearsExperience  Salary
Department
Finance            7.333333  197000
HR                 3.000000  147000
IT                 5.500000  125000